"""Напишите программу принимающую на вход список [1,2,3] и выводящую все возможные комбинации его членов.:
Ответ: (1, 2, 3), (1, 3, 2), (2, 1, 3), (2, 3, 1), (3, 1, 2), (3, 2, 1)"""





s = [ 1, 2, 3, 4]
p = [0 for _ in s ]
i = 1
res = []

while i < len(s):
    if p[i] < i:
        j = 0 if i % 2 == 0 else p[i]
        s[i], s[j] = s[j], s[i]
        p[i] += 1
        i = 1
        if s not in res:
            res.append(list(s))
    else:
        p[i] = 0
        i += 1

print(res)